In [3]:
import pandas as pd

# Beispiel Daten und mit fehlenden Werten
data = {
    'Name': ['Alice', 'Bob', 'Charlie', None, 'Eve'],
    'Alter': [25, None, 30, 22, None],
    'Stadt': ['Berlin', 'München', None, 'Hamburg', 'Köln'],
    'Einkommen': [50000, 60000, None, 45000, 70000]
}   
df = pd.DataFrame(data)
print("OG DataFrame:")
print(df)

# Als CSV-Datei speichern
df.to_csv("../data/sample_with_missing.csv", index=False)

OG DataFrame:
      Name  Alter    Stadt  Einkommen
0    Alice   25.0   Berlin    50000.0
1      Bob    NaN  München    60000.0
2  Charlie   30.0     None        NaN
3     None   22.0  Hamburg    45000.0
4      Eve    NaN     Köln    70000.0

In [5]:
# Überblick: Wie viele fehlende Werte gibt es in jeder Spalte?
print("Fehlerhafte Werte pro Spalte:")
print(df.isnull().sum())

#Prozentuale Verteilung der fehlenden Werte
print("\nProzentuale Verteilung der fehlenden Werte:")
print(df.isnull().mean() * 100)

# Zeilen mit mindestens einem NaN anzeigen
print("\nZeilen mit NaN:")
display(df[df.isnull().any(axis=1)])

Fehlerhafte Werte pro Spalte:
Name         1
Alter        2
Stadt        1
Einkommen    1
dtype: int64

Prozentuale Verteilung der fehlenden Werte:
Name         20.0
Alter        40.0
Stadt        20.0
Einkommen    20.0
dtype: float64

Zeilen mit NaN:

      Name  Alter    Stadt  Einkommen
1      Bob    NaN  München    60000.0
2  Charlie   30.0     None        NaN
3     None   22.0  Hamburg    45000.0
4      Eve    NaN     Köln    70000.0

In [6]:
# Fehlende Alter durch Durchschnitt ersetzen
df['Alter'] = df['Alter'].fillna(df['Alter'].mean())

# Fehlende Stadt mit Platzhalter
df['Stadt'] = df['Stadt'].fillna('Unbekannt')

# Zeilen mit fehlendem Einkommen löschen
df = df.dropna(subset=['Einkommen'])

display(df)

    Name      Alter    Stadt  Einkommen
0  Alice  25.000000   Berlin    50000.0
1    Bob  25.666667  München    60000.0
3   None  22.000000  Hamburg    45000.0
4    Eve  25.666667     Köln    70000.0